src/Documents/ОплатаОбучения/ОплатаОбучения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаОбучения</name>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ОплатаОбучения/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Взаиморасчеты.Очистить();
	
	Движение = Движения.Взаиморасчеты.ДобавитьРасход();
	
	Движение.Период 		= Дата;
	Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;
	Движение.Студент		= Студент;
	Движение.Сумма			= Сумма;
	
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Записать();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВзаиморасчетыОстатки.Студент,
	|	-ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&МоментВремени, Студент = &Студент) КАК ВзаиморасчетыОстатки
	|ГДЕ
	|	ВзаиморасчетыОстатки.СуммаОстаток < 0";
	
	ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);
    Запрос.УстановитьПараметр("МоментВремени", ГраницаКонтроля);
	Запрос.УстановитьПараметр("Студент", Студент);
    РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Сообщение = Новый СообщениеПользователю();
		
		Сообщение.Текст = СтрШаблон("Нельзя списать %1 рублей, отрицательный остаток - %2", 
																					Сумма, 
																					Выборка.СуммаОстаток);
		Сообщение.Поле = "Сумма";
		
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.КлючДанных	= Ссылка;
		
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
